Напишите программу, которая выводит на экран следующие строки:

NICKNAME: Neo
CITY: St-Petersburg
AGE: 35
HEIGHT: 180
WEIGHT: 75


  #include <stdio.h>

int main() {
  printf("NICKNAME: Neo\n");
  printf("CITY: St-Petersburg\n");
  printf("AGE: 35\n");
  printf("HEIGHT: 180\n");
  printf("WEIGHT: 75\n");
  return 0;
}
