Напишите программу, которая печатает строку "Hello, World!" без кавычек.

#include <stdio.h>    //подключаем основную библиотеку

int main()    //основная функция кода
{
    printf("Hello, World!");    //вывод текста
    return 0;    //конец функции main
}
